const quizData = [
    {
      question: "日本はWBCで何回優勝している？",
      choices: ["1回", "2回", "3回", "4回"],
      answer: "3回"
    },

    {
      question: "日本のプロ野球は何球団ある？",
      choices: ["10球団", "11球団", "12球団", "13球団"],
      answer: "12球団"
    },

    {
      question: "日本のプロ野球は何リーグある？",
      choices: ["1リーグ", "2リーグ", "3リーグ", "4リーグ"],
      answer: "2リーグ"
    },

    {
      question: "野球の試合で、チームが攻撃側から守備側に交代するのは、何アウト後？",
      choices: ["1アウト", "2アウト", "3アウト", "4アウト"],
      answer: "3アウト"
    },

    {
      question: "次のうち、野球のポジションではないものはどれ？",
      choices: ["ピッチャー", "キャッチャー", "ショート", "ゴールキーパー"],
      answer: "ゴールキーパー"
    },

    {
      question: "ホームランを打った際に得られる得点は、最大で何点?",
      choices: ["1点", "2点", "3点", "4点"],
      answer: "4点"
    },

    {
      question: "イチロー選手がメジャーで最初に所属していたチームはどれ？", 
      choices: ["ニューヨーク・ヤンキース", "シアトル・マリナーズ", "ボストン・レッドソックス", "ロサンゼルス・ドジャース"],
      answer: "シアトル・マリナーズ"
    },

    {
      question: "野球における「完全試合」とは、どのような試合のことを指しますか？",
      choices: ["ヒットを打たれずに勝利した試合", "1点も与えずに勝利した試合",
      "相手チームの全ての打者をアウトにして、1人も出塁させずに勝利した試合",
      "10点差で勝利した試合"],
      answer: "相手チームの全ての打者をアウトにして、1人も出塁させずに勝利した試合"
    },

    {
      question: "「三冠王」とは、1人の打者が同一シーズンで達成するどのような成績を指しますか？",
      choices: ["打率・本塁打・盗塁数がリーグ1位", "打率・本塁打・打点がリーグ1位", "打率・本塁打・安打数がリーグ1位", "単打数・二塁打数・三塁打数がリーグ1位"],
      answer: "打率・本塁打・打点がリーグ1位"
    }, 

    {
      question: "2023年4月時点で、日本のプロ野球界史上最も多く三冠王のタイトルを獲得した選手は？", 
      choices: ["松中信彦", "野村克也", "王貞治", "落合博満"],
      answer: "落合博満"
    },

    {
      question: "2023年4月時点で、日本プロ野球界史上最も高い打率（規定打席）を記録した選手は？",
      choices: ["イチロー", "張本勲", "内川聖一", "ランディ・バース"], 
      answer: "ランディ・バース"
    },

    {
      question: "2023年4月時点で、MLB（メジャーリーグ）で最も多くの本塁打を記録した選手は？",
      choices: ["大谷翔平", "ベーブ・ルース", "ハンク・アーロン", "バリー・ボンズ"],
      answer: "バリー・ボンズ"
    },

    {
      question: "日本プロ野球界で「世界の王」と称される選手は？",
      choices: ["張本勲", "長嶋茂雄", "王貞治", "イチロー"],
      answer: "王貞治"
    }

];

export default quizData;